In [1]:
import pandas as pd
import numpy as np

In [8]:
students_perfomance = pd.read_csv('./StudentsPerformance.csv')

In [9]:
students_perfomance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [12]:
students_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [13]:
students_perfomance.describe() #статистика числовых столбцов

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [14]:
students_perfomance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [15]:
students_perfomance.shape

(1000, 8)

In [16]:
students_perfomance.groupby('gender').aggregate({'writing score':'mean'}) #группировка

        writing score
gender
female      72.467181
male        63.311203

In [33]:
students_perfomance.iloc[0:5,0:3]#отбираем нужные столбцы и строки по их индексам

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [34]:
students_perfomance.iloc[[0,3,999],[0,1,4]]

     gender race/ethnicity test preparation course
0    female        group B                    none
3      male        group A                    none
999  female        group D                    none

In [36]:
students_perfomance["math score"]

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

In [38]:
sp_with_names = students_perfomance.iloc[[0,3,4,7,8]]

In [39]:
sp_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [41]:
sp_with_names.index #показывает индексы строк, можно менять

Int64Index([0, 3, 4, 7, 8], dtype='int64')

In [47]:
sp_with_names.index = ["Cersei","Tywin","Gregor","Joffrey","Ilyn Payne"]
sp_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cersei,female,group B,bachelor's degree,standard,none,72,72,74
Tywin,male,group A,associate's degree,free/reduced,none,47,57,44
Gregor,male,group C,some college,standard,none,76,78,75
Joffrey,male,group B,some college,free/reduced,none,40,43,39
Ilyn Payne,male,group D,high school,free/reduced,completed,64,64,67

In [64]:
sp_with_names.loc[['Cersei','Joffrey','Gregor'],['lunch']] # выбирает нужные столбцы и строки по их именам

                lunch
Cersei       standard
Joffrey  free/reduced
Gregor       standard

In [57]:
students_perfomance.loc[1:4,['gender','lunch']]

   gender         lunch
1  female      standard
2  female      standard
3    male  free/reduced
4    male      standard

In [74]:
sp_with_names.iloc[:,0]

Cersei        female
Tywin           male
Gregor          male
Joffrey         male
Ilyn Payne      male
Name: gender, dtype: object

In [75]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [78]:
students_perfomance.iloc[:,0]

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [93]:
my_series1 = pd.Series([1,2,3],index = ['a','b','c'])
my_series2 = pd.Series([4,5,6],index = ['a','b','d'])
my_series1

a    1
b    2
c    3
dtype: int64

In [91]:
pd.DataFrame({'col_name_1':my_series1,'col_name_2':my_series2})

   col_name_1  col_name_2
a         1.0         4.0
b         2.0         5.0
c         3.0         NaN
d         NaN         6.0

In [95]:
students_perfomance[['gender','lunch']]

     gender         lunch
0    female      standard
1    female      standard
2    female      standard
3      male  free/reduced
4      male      standard
..      ...           ...
995  female      standard
996    male  free/reduced
997  female  free/reduced
998  female      standard
999  female  free/reduced

[1000 rows x 2 columns]

In [96]:
students_perfomance['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [108]:
titanic = pd.read_csv('titanic.csv')
titanic.dtype

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object